MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
/* Loudness filter wrapper */
static inline float loudness_process(BiquadState *state, float input)
{
    return biquad_process_coef(state, input,
                               loudness_b0, loudness_b1, loudness_b2,
                               loudness_a1, loudness_a2);
}

/* Bass Boost filter wrapper */
static inline float bass_process(BiquadState *state, float input)
{
    return biquad_process_coef(state, input,
                               bass_b0, bass_b1, bass_b2,
                               bass_a1, bass_a2);
}

/* Preset EQ processing - applies preset-specific filters */
static inline void preset_process(float *left, float *right)
{
    switch (current_preset)
    {
        case PRESET_OFFICE:
            /* Single stage: subtle high-shelf */
            *left  = biquad_process_coef(&preset_eq1_L, *left,
                        preset_office_b0, preset_office_b1, preset_office_b2,
                        preset_office_a1, preset_office_a2);
            *right = biquad_process_coef(&preset_eq1_R, *right,
                        preset_office_b0, preset_office_b1, preset_office_b2,
                        preset_office_a1, preset_office_a2);
            break;

        case PRESET_FULL:
            /* Two stages: bass boost + treble boost */
            *left  = biquad_process_coef(&preset_eq1_L, *left,
                        preset_full_bass_b0, preset_full_bass_b1, preset_full_bass_b2,
                        preset_full_bass_a1, preset_full_bass_a2);
            *right = biquad_process_coef(&preset_eq1_R, *right,
                        preset_full_bass_b0, preset_full_bass_b1, preset_full_bass_b2,
                        preset_full_bass_a1, preset_full_bass_a2);
            *left  = biquad_process_coef(&preset_eq2_L, *left,
                        preset_full_treble_b0, preset_full_treble_b1, preset_full_treble_b2,
                        preset_full_treble_a1, preset_full_treble_a2);
            *right = biquad_process_coef(&preset_eq2_R, *right,
                        preset_full_treble_b0, preset_full_treble_b1, preset_full_treble_b2,
                        preset_full_treble_a1, preset_full_treble_a2);
            break;

        case PRESET_NIGHT:
            /* Single stage: reduced bass */
            *left  = biquad_process_coef(&preset_eq1_L, *left,
                        preset_night_b0, preset_night_b1, preset_night_b2,
                        preset_night_a1, preset_night_a2);
            *right = biquad_process_coef(&preset_eq1_R, *right,
                        preset_night_b0, preset_night_b1, preset_night_b2,
                        preset_night_a1, preset_night_a2);
            break;

        case PRESET_SPEECH:
            /* Two stages: high-pass + mid boost */
            *left  = biquad_process_coef(&preset_eq1_L, *left,
                        preset_speech_hp_b0, preset_speech_hp_b1, preset_speech_hp_b2,
                        preset_speech_hp_a1, preset_speech_hp_a2);
            *right = biquad_process_coef(&preset_eq1_R, *right,
                        preset_speech_hp_b0, preset_speech_hp_b1, preset_speech_hp_b2,
                        preset_speech_hp_a1, preset_speech_hp_a2);
            *left  = biquad_process_coef(&preset_eq2_L, *left,
                        preset_speech_mid_b0, preset_speech_mid_b1, preset_speech_mid_b2,
                        preset_speech_mid_a1, preset_speech_mid_a2);
            *right = biquad_process_coef(&preset_eq2_R, *right,
                        preset_speech_mid_b0, preset_speech_mid_b1, preset_speech_mid_b2,
                        preset_speech_mid_a1, preset_speech_mid_a2);
            break;
    }
}

/* Reset preset filter states (call when changing presets) */
static void reset_preset_filters(void)
{
    memset(&preset_eq1_L, 0, sizeof(preset_eq1_L));
    memset(&preset_eq1_R, 0, sizeof(preset_eq1_R));
    memset(&preset_eq2_L, 0, sizeof(preset_eq2_L));
    memset(&preset_eq2_R, 0, sizeof(preset_eq2_R));
}

/* DRC/Compressor process - returns smoothed gain factor */
static inline float drc_process(float input_level)
{
    /* Peak detection with attack/release envelope */
    float abs_level = (input_level < 0) ? -input_level : input_level;

    if (abs_level > drc_envelope) {
        /* Attack: fast rise */
        drc_envelope += DRC_ATTACK_COEF * (abs_level - drc_envelope);
    } else {
        /* Release: slow fall */
        drc_envelope += DRC_RELEASE_COEF * (abs_level - drc_envelope);
    }

    /* Calculate target gain */
    float target_drc_gain;
    if (drc_envelope > DRC_THRESHOLD_LIN) {
        /* Above threshold: apply compression */
        float excess_ratio = drc_envelope / DRC_THRESHOLD_LIN;
        float compressed = DRC_THRESHOLD_LIN * powf(excess_ratio, 1.0f / DRC_RATIO);
        target_drc_gain = (compressed / drc_envelope) * DRC_MAKEUP_LIN;
    } else {
        /* Below threshold: just apply makeup gain */
        target_drc_gain = DRC_MAKEUP_LIN;
    }

    /* Smooth the gain changes to avoid artifacts */
    drc_gain_smooth += 0.01f * (target_drc_gain - drc_gain_smooth);

    return drc_gain_smooth;
}

/* Forward declaration needed for functions below */
void Error_Handler(void);

/**
 * @brief  Initialize DAC1 Channel 1 (PA4) for IN-13 VU meter
 */
static void MX_DAC1_Init(void)
{
    DAC_ChannelConfTypeDef sConfig = {0};

    hdac1.Instance = DAC1;
    if (HAL_DAC_Init(&hdac1) != HAL_OK)
    {
        Error_Handler();
    }

    sConfig.DAC_Trigger = DAC_TRIGGER_NONE;
    sConfig.DAC_OutputBuffer = DAC_OUTPUTBUFFER_ENABLE;
    if (HAL_DAC_ConfigChannel(&hdac1, &sConfig, DAC_CHANNEL_1) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
 * @brief  Prime the IN-13 tube with a 100% burst
 *         Ensures gas discharge starts from bottom (via auxiliary cathode)
 */
static void VU_Prime(void)
{
    HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, VU_DAC_MAX);
    HAL_Delay(VU_PRIME_MS);
    HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, VU_DAC_OFF);
    vu_primed = 1;
}

/**
 * @brief  Update VU meter from audio buffer RMS level
 *         Called from Audio_Process (ISR context) - only updates smoothed RMS
 * @param  rx_buf: Audio buffer (stereo interleaved)
 * @param  samples: Number of samples (L+R)
 */
static void VU_UpdateRMS(int16_t *rx_buf, uint16_t samples)
{
    float sum = 0.0f;
    for (uint16_t i = 0; i < samples; i += 2)
    {
        float s = ((float)rx_buf[i] + (float)rx_buf[i + 1]) * 0.5f;
        sum += s * s;
    }
    float rms = sqrtf(sum / (float)(samples / 2));

    /* Asymmetric smoothing: fast attack, moderate release */
    if (rms > vu_rms_smooth)
        vu_rms_smooth = rms * 0.3f + vu_rms_smooth * 0.7f;
    else
        vu_rms_smooth = rms * 0.10f + vu_rms_smooth * 0.90f;
}

/**
 * @brief  Write smoothed RMS value to DAC (call from main loop, not ISR)
 */
static void VU_WriteDac(void)
{
    if (!vu_primed) return;

    /* Music RMS is typically ~3000-10000 (not 32768 peak).
     * Use -20dB (0.1 = ~3277) as reference for full scale,
     * with sqrt compression for a more natural VU response. */
    float normalized = vu_rms_smooth / 10000.0f;
    if (normalized > 1.0f) normalized = 1.0f;

    /* Below a threshold: turn tube completely off to avoid random spots */
    if (normalized < 0.01f)
    {
        HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, VU_DAC_OFF);
        return;
    }

