MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
    /* Sqrt compression: spreads mid-range, feels more natural */
    normalized = sqrtf(normalized);

    uint16_t dac_val = VU_DAC_MIN + (uint16_t)(normalized * (float)(VU_DAC_MAX - VU_DAC_MIN));
    if (dac_val > VU_DAC_MAX) dac_val = VU_DAC_MAX;

    HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, dac_val);
}

/* DMA drift detection and auto-recovery */
#define DMA_DRIFT_THRESHOLD     100     /* Max allowed drift in samples - safety net only */
#define DMA_DRIFT_CHECK_INTERVAL 500    /* Check every 500ms */
static int16_t dma_initial_offset = 0;  /* Captured after startup */
static uint8_t dma_offset_captured = 0; /* Flag: initial offset valid */
static volatile uint32_t dma_resync_count = 0;  /* Total resyncs */

/**
 * @brief  Restart SAI/DMA to resynchronize RX and TX
 *         Called when DMA drift exceeds threshold
 */
static void SAI_DMA_Resync(void)
{
    /* Stop both DMA streams */
    HAL_SAI_DMAStop(&hsai_rx);
    HAL_SAI_DMAStop(&hsai_tx);

    /* Clear errors and flush FIFOs */
    __HAL_SAI_CLEAR_FLAG(&hsai_rx, SAI_FLAG_OVRUDR | SAI_FLAG_AFSDET | SAI_FLAG_LFSDET | SAI_FLAG_WCKCFG);
    __HAL_SAI_CLEAR_FLAG(&hsai_tx, SAI_FLAG_OVRUDR | SAI_FLAG_AFSDET | SAI_FLAG_LFSDET | SAI_FLAG_WCKCFG);
    SAI1_Block_A->CR2 |= SAI_xCR2_FFLUSH;
    SAI1_Block_B->CR2 |= SAI_xCR2_FFLUSH;

    /* Clear buffers */
    memset(audio_tx_buffer, 0, sizeof(audio_tx_buffer));

    /* Restart RX only — TX will re-align on next RxCplt callback */
    tx_dma_started = 0;
    HAL_SAI_Receive_DMA(&hsai_rx, (uint8_t *)audio_rx_buffer, AUDIO_BUFFER_SIZE * 2);

    /* Reset drift tracking */
    dma_offset_captured = 0;
    dma_resync_count++;
}

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_SAI1_Init(void);
static void MX_DAC1_Init(void);
void Error_Handler(void);

/* Audio processing */
static void Audio_Process(int16_t *rx_buf, int16_t *tx_buf, uint16_t samples);

/* Debug printf redirection to USART3 */
int _write(int file, char *ptr, int len)
{
    HAL_UART_Transmit(&huart3, (uint8_t *)ptr, len, HAL_MAX_DELAY);
    return len;
}

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{
    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();          // DMA must be initialized before peripherals that use it
    MX_USART3_UART_Init();  // Debug console first

    /* Boot message with build number */
    printf("\r\n\r\n*** 42dB DSP Engine (Build #%d) ***\r\n", BUILD_NUMBER);

    printf("[OK] HAL initialized\r\n");
    printf("[OK] Clock configured\r\n");
    printf("[OK] GPIO initialized\r\n");
    printf("[OK] DMA initialized\r\n");
    printf("[OK] USART3 (debug console) initialized\r\n");

    MX_USART2_UART_Init();  // ESP32 BLE control
    printf("[OK] USART2 (ESP32 BLE) initialized\r\n");

    MX_SAI1_Init();  // I2S Audio
    printf("[OK] SAI1 (I2S Audio) initialized\r\n");
    printf("[NOTE] Use 74HCT04 buffer for I2S signals (5V tolerant)\r\n");

    MX_DAC1_Init();  // IN-13 VU meter
    HAL_DAC_Start(&hdac1, DAC_CHANNEL_1);
    VU_Prime();
    printf("[OK] DAC1 (IN-13 VU meter on PA4) initialized and primed\r\n");

    /* Print startup banner */
    printf("\r\n");
    printf("========================================\r\n");
    printf("42dB DSP Engine v0.5.0  Protocol v%d\r\n", PROTOCOL_VERSION);
    printf("========================================\r\n");
    printf("ESP32 BLE: PD5(TX), PD6(RX) @ 115200\r\n");
    printf("Debug:     PD8(TX), PD9(RX) @ 115200\r\n");
    printf("I2S Input: PE5(SCK), PE4(FS), PE6(SD)\r\n");
    printf("I2S Output: PE3(SD)\r\n");
    printf("Audio:     %d Hz, %d ch, %d samples/buf\r\n",
           AUDIO_SAMPLE_RATE, AUDIO_CHANNELS, AUDIO_BUFFER_SAMPLES);
    printf("========================================\r\n\r\n");

    /* Start receiving data from ESP32 via interrupt */
    HAL_UART_Receive_IT(&huart2, &rx_byte, 1);
    printf("[OK] USART2 RX interrupt enabled\r\n");

    /* Clear audio buffers */
    memset(audio_rx_buffer, 0, sizeof(audio_rx_buffer));
    memset(audio_tx_buffer, 0, sizeof(audio_tx_buffer));

    /* Clear any pending SAI errors and flush FIFOs before starting */
    __HAL_SAI_CLEAR_FLAG(&hsai_rx, SAI_FLAG_OVRUDR | SAI_FLAG_AFSDET | SAI_FLAG_LFSDET | SAI_FLAG_WCKCFG);
    __HAL_SAI_CLEAR_FLAG(&hsai_tx, SAI_FLAG_OVRUDR | SAI_FLAG_AFSDET | SAI_FLAG_LFSDET | SAI_FLAG_WCKCFG);

    /* Flush FIFOs */
    SAI1_Block_A->CR2 |= SAI_xCR2_FFLUSH;
    SAI1_Block_B->CR2 |= SAI_xCR2_FFLUSH;

    /* Pre-fill TX buffer with silence to avoid garbage at startup */
    memset(audio_tx_buffer, 0, sizeof(audio_tx_buffer));

    /* Start RX DMA only. TX DMA will be started from the first HAL_SAI_RxCpltCallback
     * to guarantee half-buffer alignment: when RxCplt fires, RX just wrapped to position 0,
     * so TX also starts at 0. This eliminates the random initial phase offset that would
     * otherwise cause a race condition once drift grows to ±512 samples (~85 sec). */
    HAL_StatusTypeDef rx_status = HAL_SAI_Receive_DMA(&hsai_rx, (uint8_t *)audio_rx_buffer,
                                                       AUDIO_BUFFER_SIZE * 2);
    tx_dma_started = 0;

    if (rx_status == HAL_OK)
    {
        printf("[OK] SAI1 RX DMA started - TX will align on first RxCplt\r\n");
    }
    else
    {
        printf("[WARN] DMA start failed: RX=%d\r\n", rx_status);
    }

    printf("\r\n[INFO] PASSTHROUGH MODE - Audio from ESP32 to DAC\r\n");
    printf("       RX: BCLK->PE5, LRCK->PE4, SD->PE6\r\n");
    printf("       TX: SD->PE3 (shares BCLK/LRCK from ESP32)\r\n\r\n");

