MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
    /* Debug: print SAI and GPIO register status */
    printf("[DEBUG] SAI1_A CR1=0x%08lX SR=0x%08lX\r\n",
           SAI1_Block_A->CR1, SAI1_Block_A->SR);
    printf("[DEBUG] SAI1_B CR1=0x%08lX SR=0x%08lX\r\n",
           SAI1_Block_B->CR1, SAI1_Block_B->SR);
    /* GPIO mode and alternate function for PE4,PE5,PE6 (AF6=SAI1) */
    printf("[DEBUG] GPIOE MODER=0x%08lX AFR[0]=0x%08lX\r\n",
           GPIOE->MODER, GPIOE->AFR[0]);
    /* Check SAI1 clock source (D2CCIP1R bits 2:0 = SAI1SEL) */
    printf("[DEBUG] RCC D2CCIP1R=0x%08lX (SAI1SEL bits 2:0)\r\n",
           RCC->D2CCIP1R);
    /* Read GPIO input values to verify signals */
    printf("[DEBUG] GPIOE IDR=0x%04lX (PE4=%d PE5=%d PE6=%d)\r\n",
           GPIOE->IDR,
           (GPIOE->IDR >> 4) & 1,
           (GPIOE->IDR >> 5) & 1,
           (GPIOE->IDR >> 6) & 1);

    /* Variables for periodic status */
    uint32_t last_status_time = 0;
    uint32_t last_buffer_count = 0;
    uint32_t debug_counter = 0;
    uint32_t last_drift_check = 0;

    /* Infinite loop */
    while (1)
    {
        /* Audio processing happens in RX DMA callbacks for lowest latency */

        /* DMA drift detection - check every 500ms */
        uint32_t now = HAL_GetTick();
        if (now - last_drift_check >= DMA_DRIFT_CHECK_INTERVAL && audio_buffer_count > 100)
        {
            /* Read both NDTR as close together as possible */
            uint32_t rx_ndtr = DMA1_Stream0->NDTR;
            uint32_t tx_ndtr = DMA1_Stream1->NDTR;
            int16_t current_offset = (int16_t)(tx_ndtr - rx_ndtr);

            if (!dma_offset_captured)
            {
                /* Capture initial offset after startup/resync */
                dma_initial_offset = current_offset;
                dma_offset_captured = 1;
            }
            else
            {
                /* Track drift for monitoring only — resync disabled because:
                 * 1. Half-buffer processing tolerates arbitrary drift
                 * 2. Hard DMA restart causes worse glitches than drift itself
                 * 3. Master I2S clock jitter causes rapid drift that would
                 *    trigger constant resyncs, each one an audible click */
                (void)0;  /* drift monitoring continues in debug output below */
            }
            last_drift_check = now;
        }

        /* Print status every second */
        if (now - last_status_time >= 1000)
        {
            uint32_t buffers_per_sec = audio_buffer_count - last_buffer_count;
            if (audio_buffer_count > 0)
            {
                printf("[AUDIO] Buffers/sec: %lu, Total: %lu, Overruns: %lu, Resyncs: %lu\r\n",
                       buffers_per_sec, audio_buffer_count, audio_overrun_count, dma_resync_count);
            }
            /* Debug: show SAI and DMA status every 5 seconds */
            debug_counter++;
            if ((debug_counter % 5) == 0)
            {
                /* Read NDTR close together for accurate offset */
                uint32_t rx_ndtr = DMA1_Stream0->NDTR;
                uint32_t tx_ndtr = DMA1_Stream1->NDTR;
                int16_t offset = (int16_t)(tx_ndtr - rx_ndtr);
                int16_t drift = offset - dma_initial_offset;
                if (drift > 512) drift -= 1024;
                if (drift < -512) drift += 1024;

                printf("[DEBUG] SAI_A: SR=0x%lX CR1=0x%08lX\r\n",
                       SAI1_Block_A->SR, SAI1_Block_A->CR1);
                printf("[DEBUG] SAI_B: SR=0x%lX CR1=0x%08lX\r\n",
                       SAI1_Block_B->SR, SAI1_Block_B->CR1);
                printf("[DEBUG] DMA RX NDTR=%lu, TX NDTR=%lu, offset=%d, drift=%d\r\n",
                       rx_ndtr, tx_ndtr, offset, drift);
                extern volatile uint32_t audio_process_count;
                printf("[DEBUG] RX[0..3]: %d %d %d %d\r\n",
                       audio_rx_buffer[0], audio_rx_buffer[1],
                       audio_rx_buffer[2], audio_rx_buffer[3]);
                printf("[DEBUG] TX[0..3]: %d %d %d %d\r\n",
                       audio_tx_buffer[0], audio_tx_buffer[1],
                       audio_tx_buffer[2], audio_tx_buffer[3]);
                printf("[DEBUG] Process=%lu\r\n", audio_process_count);
            }
            last_buffer_count = audio_buffer_count;
            last_status_time = now;
        }

        /* Process ESP32 UART data - accumulate into line buffer */
        while (rx_head != rx_tail)
        {
            uint8_t data = rx_buffer[rx_tail];
            rx_tail = (rx_tail + 1) % RX_BUFFER_SIZE;

            if (data == '\n')
            {
                /* End of line - process command */
                line_buffer[line_pos] = '\0';
                if (line_pos > 0 && line_buffer[line_pos - 1] == '\r')
                {
                    line_buffer[line_pos - 1] = '\0';  /* Remove \r */
                }
                if (line_pos > 0)
                {
                    Process_GATT_Command(line_buffer);
                }
                line_pos = 0;
            }
            else if (line_pos < LINE_BUFFER_SIZE - 1)
            {
                line_buffer[line_pos++] = (char)data;
            }
        }

        /* Update IN-13 VU meter DAC output */
        VU_WriteDac();

        /* Small delay to prevent tight loop when no audio */
        HAL_Delay(1);
    }
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /** Supply configuration update enable
     */
    HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);

    /** Configure the main internal regulator output voltage
     */
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);

    while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

    /** Initializes the RCC Oscillators according to the specified parameters
     * in the RCC_OscInitTypeDef structure.
     */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM = 1;
    RCC_OscInitStruct.PLL.PLLN = 120;
    RCC_OscInitStruct.PLL.PLLP = 2;
    RCC_OscInitStruct.PLL.PLLQ = 2;
    RCC_OscInitStruct.PLL.PLLR = 2;
    RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_3;
    RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
    RCC_OscInitStruct.PLL.PLLFRACN = 0;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    /** Initializes the CPU, AHB and APB buses clocks
     */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                                |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                                |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
    RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

