MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
static uint32_t sine_phase = 0;
static volatile uint8_t dsp_sine_test = 0;  /* Sine test mode: generates 1kHz tone internally */

/**
 * @brief  Parse hex string to bytes
 * @param  hex: Input hex string (e.g., "0164")
 * @param  out: Output byte array
 * @param  max_len: Maximum bytes to parse
 * @retval Number of bytes parsed
 */
static int hex_to_bytes(const char *hex, uint8_t *out, int max_len)
{
    int len = 0;
    while (*hex && *(hex + 1) && len < max_len)
    {
        char byte_str[3] = {hex[0], hex[1], '\0'};
        out[len++] = (uint8_t)strtol(byte_str, NULL, 16);
        hex += 2;
    }
    return len;
}

/**
 * @brief  Process GATT command received from ESP32
 *         Format: GATT:<characteristic>:<hex_data>
 *         Example: GATT:CTRL:0102 (Set preset to NIGHT)
 * @param  line: Complete line without \r\n
 */
static void Process_GATT_Command(const char *line)
{
    /* Check if it's a GATT command */
    if (strncmp(line, "GATT:", 5) != 0)
    {
        printf("[ESP32] %s\r\n", line);
        return;
    }

    /* Parse: GATT:<char>:<hex> */
    const char *char_start = line + 5;
    const char *colon = strchr(char_start, ':');
    if (!colon)
    {
        printf("[ESP32] Invalid GATT format: %s\r\n", line);
        return;
    }

    /* Extract characteristic name */
    int char_len = colon - char_start;
    char char_name[32];
    if (char_len >= (int)sizeof(char_name)) char_len = sizeof(char_name) - 1;
    strncpy(char_name, char_start, char_len);
    char_name[char_len] = '\0';

    /* Extract hex data */
    const char *hex_data = colon + 1;
    uint8_t cmd_bytes[16];
    int cmd_len = hex_to_bytes(hex_data, cmd_bytes, sizeof(cmd_bytes));

    /* Log the command */
    printf("[GATT] %s:", char_name);
    for (int i = 0; i < cmd_len; i++)
    {
        printf(" %02X", cmd_bytes[i]);
    }
    printf("\r\n");

    /* Handle specific commands - accept any characteristic that ends with "CTRL" or "TRL"
     * to handle occasional UART byte loss */
    if ((strstr(char_name, "CTRL") != NULL || strstr(char_name, "TRL") != NULL) && cmd_len >= 2)
    {
        uint8_t cmd_type = cmd_bytes[0];
        uint8_t cmd_value = cmd_bytes[1];

        switch (cmd_type)
        {
            case 0x01:  /* Set Preset */
                {
                    const char *preset_names[] = {"OFFICE", "FULL", "NIGHT", "SPEECH"};
                    if (cmd_value <= PRESET_SPEECH) {
                        current_preset = cmd_value;
                        reset_preset_filters();
                        update_target_gain();  /* Recalculate gain (NIGHT mode has volume cap) */
                        printf("[DSP] Preset: %s\r\n", preset_names[cmd_value]);
                    } else {
                        printf("[DSP] Invalid preset: %d\r\n", cmd_value);
                    }
                }
                break;
            case 0x02:  /* Set Loudness */
                printf("[DSP] Loudness: %s\r\n", cmd_value ? "ON" : "OFF");
                dsp_loudness_enabled = cmd_value ? 1 : 0;
                if (!cmd_value) {
                    /* Reset filter state when disabling to avoid clicks */
                    memset(&loudness_state_L, 0, sizeof(loudness_state_L));
                    memset(&loudness_state_R, 0, sizeof(loudness_state_R));
                }
                break;
            case 0x04:  /* Set Mute */
                printf("[DSP] Mute: %s\r\n", cmd_value ? "ON" : "OFF");
                dsp_mute_enabled = cmd_value ? 1 : 0;
                break;
            case 0x05:  /* Set Audio Duck */
                printf("[DSP] Duck: %s\r\n", cmd_value ? "ON (-12dB)" : "OFF");
                dsp_duck_enabled = cmd_value ? 1 : 0;
                duck_target_gain = cmd_value ? DUCK_GAIN_LIN : 1.0f;
                break;
            case 0x06:  /* Set Normalizer/DRC */
                printf("[DSP] Normalizer: %s\r\n", cmd_value ? "ON" : "OFF");
                dsp_normalizer_enabled = cmd_value ? 1 : 0;
                if (!cmd_value) {
                    /* Reset DRC envelope when disabling */
                    drc_envelope = 0.0f;
                }
                break;
            case 0x07:  /* Set Volume / Device Trim */
                {
                    uint8_t trim = cmd_value > 100 ? 100 : cmd_value;
                    device_trim_value = trim;
                    update_target_gain();  /* NIGHT mode cap applied here */
                    printf("[DSP] Trim: %d%% (target gain: %.3f)\r\n",
                           trim, target_gain);
                }
                break;
            case 0x08:  /* Set Bypass */
                printf("[DSP] Bypass: %s\r\n", cmd_value ? "ON" : "OFF");
                dsp_bypass_enabled = cmd_value ? 1 : 0;
                break;
            case 0x09:  /* Set Bass Boost */
                printf("[DSP] Bass Boost: %s\r\n", cmd_value ? "ON (+8dB)" : "OFF");
                dsp_bass_boost_enabled = cmd_value ? 1 : 0;
                if (!cmd_value) {
                    /* Reset filter state when disabling to avoid clicks */
                    memset(&bass_state_L, 0, sizeof(bass_state_L));
                    memset(&bass_state_R, 0, sizeof(bass_state_R));
                }
                break;
            case 0x0A:  /* Sine Test Mode */
                printf("[DSP] Sine Test: %s (1kHz tone, ignores input)\r\n", cmd_value ? "ON" : "OFF");
                dsp_sine_test = cmd_value ? 1 : 0;
                sine_phase = 0;
                break;
            default:
                printf("[DSP] Unknown command: 0x%02X\r\n", cmd_type);
                break;
        }
    }
}

static void Audio_Process(int16_t *rx_buf, int16_t *tx_buf, uint16_t samples)
{
    audio_process_count++;

    /* Update VU meter RMS from input signal (pre-DSP for true level) */
    VU_UpdateRMS(rx_buf, samples);

    /* Sine test mode: generate 1kHz tone internally, ignore input */
    if (dsp_sine_test)
    {
        /* 1kHz at 44100Hz: step through 256-entry table at 256*1000/44100 ≈ 5.8 per sample
         * Using fixed-point: phase_increment = (256 * 1000 * 256) / 44100 ≈ 1486 (8.8 fixed) */
        for (uint16_t i = 0; i < samples; i += 2)
        {
            int16_t val = sine_table[(sine_phase >> 8) & 0xFF] >> 2;  /* -12dB */
            tx_buf[i]     = val;
            tx_buf[i + 1] = val;
            sine_phase += 1486;  /* ~1kHz */
        }
        return;
    }

    /* Bypass mode: direct passthrough without any processing */
    if (dsp_bypass_enabled)
    {
        memcpy(tx_buf, rx_buf, samples * sizeof(int16_t));
        return;
    }

